const shlokas = [
  "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन",
  "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्",
  "योगः कर्मसु कौशलम्",
  "श्रद्धावान् लभते ज्ञानम्",
  "न हि ज्ञानेन सदृशं पवित्रमिह विद्यते",
  "सत्यं वद धर्मं चर",
  "विद्या ददाति विनयं",
  "उद्योगिनं पुरुषसिंहमुपैति लक्ष्मीः",
  "चरैवेति चरैवेति",
  "नायमात्मा बलहीनेन लभ्यः",
  "उत्तिष्ठत जाग्रत प्राप्य वरान्निबोधत",
  "धैर्यं सर्वत्र साधनम्",
  "आत्मैव ह्यात्मनो बन्धुः",
  "साहसे श्रीः प्रतिवसति",
  "कर्म प्रधानं विश्वस्य",
  "सर्वं ज्ञानप्लवेनैव वृजिनं सन्तरिष्यसि",
  "नास्ति विद्यासमं चक्षुः",
  "सत्यमेव जयते",
  "मन एव मनुष्याणां कारणं बन्धमोक्षयोः",
  "यथा चिन्तयति मनुष्यः तथा भवति"
];

const button =document.querySelector('button');
const quote=document.querySelector('h1');


 button.addEventListener('click', ()=>{
const randomindex= Math.floor(Math.random()*shlokas.length);
quote.textContent=shlokas[randomindex];

 })